#ifndef C_DIALOG_MAIN_H
#define C_DIALOG_MAIN_H

//****************************************************************************************************
// ласс главного окна
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "stdafx.h"
#include <stdint.h>
#include <vector>
#include <string>

//****************************************************************************************************
//макроопределени€
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объ€влени€
//****************************************************************************************************

//****************************************************************************************************
// ласс главного окна
//****************************************************************************************************
class CDialog_Main:public CDialog
{
 public:
  //-перечислени€---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------

  //параметры материала
  struct SMatherialParam
  {
   std::string Sigma;//сечение стимулирующего излучени€
   std::string N;//показатель преломлени€
   std::string Alpha;//коэффициент затухани€
   std::string Nd;//концентраци€ ионов неодима
   std::string Tau;//врем€ затухани€ люминесценценции
   std::string Npq;//квантовый выход люминесценценции
 
   SMatherialParam(const std::string &sigma,const std::string &n,const std::string &alpha,const std::string &nd,const std::string &tau,const std::string &npq)
   {
    Sigma=sigma;
    N=n;
    Alpha=alpha;
    Nd=nd;
    Tau=tau;
	Npq=npq;
   }
  };
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
  std::vector<SMatherialParam> MatherialList;//список материалов
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CDialog_Main(LPCTSTR lpszTemplateName,CWnd* pParentWnd);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CDialog_Main();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
 protected:
  //-функции обработки сообщений------------------------------------------------------------------------   
  DECLARE_MESSAGE_MAP()
  afx_msg void OnOK(void);
  afx_msg void OnCancel(void);
  afx_msg BOOL OnInitDialog(void);
  afx_msg void OnDestroy(void);
  afx_msg void OnButton_Calculate(void);//нажата кнопка "рассчитать"
  afx_msg void OnButton_Apply(void);//нажата кнопка "применить"
};

#endif