#include "stdafx.h"
//------------------------------------------------------------------------------
#include "cdialog_main.h"
//------------------------------------------------------------------------------
class CWinApp_Main:public CWinApp
{
 protected:
  //-Переменные класса-------------------------------------------------------
  //-Функции класса----------------------------------------------------------
  //-Прочее------------------------------------------------------------------
 public:
  //-Конструктор класса------------------------------------------------------
  CWinApp_Main(void);
  //-Деструктор класса-------------------------------------------------------
  ~CWinApp_Main();
  //-Переменные класса-------------------------------------------------------
  //-Функции класса----------------------------------------------------------
  virtual BOOL InitInstance(void);
  int ExitInstance(void);
  //-Прочее------------------------------------------------------------------
};
//-Конструктор класса--------------------------------------------------------
CWinApp_Main::CWinApp_Main(void)
{
}
//-Деструктор класса---------------------------------------------------------
CWinApp_Main::~CWinApp_Main()
{
}
//-Функции класса------------------------------------------------------------
BOOL CWinApp_Main::InitInstance(void)
{
 CWinApp::InitInstance();
 CDialog_Main cDialog_Main((LPSTR)IDD_DIALOG_MAIN,NULL);
 cDialog_Main.DoModal();
 return(TRUE);
}
int CWinApp_Main::ExitInstance(void)
{
 return(CWinApp::ExitInstance());
}

CWinApp_Main cWinApp_Main;




